Repository: siwardean/bunbukan-europe
Catalog: languages/*.po
Languages: nl_nl

source: Preserving the authentic traditions of Okinawan martial arts in Brussels
nl_nl: Behoud van de authentieke tradities van Okinavaanse vechtsporten in Brussel

source: Direct lineage from Kenei Mabuni
nl_nl: Directe lijn van Kenei Mabuni

source: Under Nakamoto Masahiro
nl_nl: Onder Nakamoto Masahiro

source: Begin Your Journey
nl_nl: Begin uw reis

source: About Bunbukan Brussels
nl_nl: Over Bunbukan Brussels

source: Heritage
nl_nl: Erfgoed

source: Mission
nl_nl: Missie

source: SINCE 1977
nl_nl: SINDS 1977

source: THE WAY
nl_nl: DE WEG

source: Part of Budo Club Berchem, we preserve and transmit traditional martial arts as practiced at the Bunbukan Honbu Dōjō in Okinawa.
nl_nl: Als onderdeel van Budo Club Berchem behouden en dragen wij traditionele vechtsporten over zoals beoefend in de Bunbukan Honbu Dōjō in Okinawa.

source: Technical depth and character development. Respect for tradition while fostering personal growth through the path of martial arts.
nl_nl: Technische diepgang en karakterontwikkeling. Respect voor traditie terwijl persoonlijke groei wordt gestimuleerd door het pad van de vechtsporten.

source: Years Teaching
nl_nl: Jaren ervaring in lesgeven

source: Experienced Instructors
nl_nl: Ervaren instructeurs

source: Authentic
nl_nl: Authentiek

source: Since 1979
nl_nl: Sinds 1979

source: Since 2001
nl_nl: Sinds 2001

source: Fundamentals
nl_nl: Basistechnieken

source: Traditional forms
nl_nl: Traditionele vormen

source: Applications
nl_nl: Toepassingen

source: Sparring
nl_nl: Sparren

source: Weapons
nl_nl: Wapens

source: Our Instructors
nl_nl: Onze instructeurs

source: 2nd Dan Shitō-Ryū, Technical Instructor (Karate)
nl_nl: 2de Dan Shitō-Ryū, Technisch Instructeur (Karate)

source: Assists in Karate instruction. Focused on precise technique and kata understanding.
nl_nl: Assisteert bij Karate-instructie. Gericht op precieze techniek en kata-begrip.

source: 6th Dan Shitō-Ryū (Shihan), Chief Instructor
nl_nl: 6de Dan Shitō-Ryū (Shihan), Hoofdinstructeur

source: Over 50 years of martial arts experience. Direct student of Kenei Mabuni and Nakamoto Masahiro.
nl_nl: Meer dan 50 jaar ervaring in de vechtsporten. Directe leerling van Kenei Mabuni en Nakamoto Masahiro.

source: 2nd Dan Shitō-Ryū, Black Belt in Kobudō, Technical Instructor
nl_nl: 2de Dan Shitō-Ryū, Zwarte Band in Kobudō, Technisch Instructeur

source: Assists in both Karate and Kobudō. Special focus on Okinawan weapons training.
nl_nl: Assisteert bij zowel Karate als Kobudō. Speciale focus op Okinavaanse wapentraining.

source: New members are always welcome. Come observe a class or join us for a free trial session.
nl_nl: Nieuwe leden zijn altijd welkom. Kom een les bijwonen of doe mee aan een gratis proefsessie.

source: Training Schedule
nl_nl: Trainingsschema

source: Wednesday
nl_nl: Woensdag

source: Friday
nl_nl: Vrijdag

source: Open to students aged 14 and up. All levels welcome.
nl_nl: Open voor studenten vanaf 14 jaar. Alle niveaus welkom.

source: Get in Touch
nl_nl: Contacteer ons

source: Questions about training or want to arrange a visit? We would love to hear from you.
nl_nl: Vragen over de training of wilt u een bezoek regelen? We horen graag van u.

source: Send Email
nl_nl: Email verzenden

source: View Map
nl_nl: Bekijk kaart

source: Affiliations
nl_nl: Affiliaties

source: Traditional Okinawan Martial Arts in Brussels
nl_nl: Traditionele Okinavaanse vechtsporten in Brussel

source: Location
nl_nl: Locatie

source: Part of Budo Club Berchem
nl_nl: Onderdeel van Budo Club Berchem

source: All rights reserved.
nl_nl: Alle rechten voorbehouden.

source: About
nl_nl: Over

source: Instructors
nl_nl: Instructeurs
